tutorials/incompressible/windSimpleFoam/turbineSiting/constant/sourcesProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      sourcesProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

disk1
{
    typeModel       actuationDiskSource;
    active          on;            //on/off switch
    timeStart       0.0;           //start time
    duration        1000.0;        //duration
    selectionMode   cellSet;       //cellSet // points //cellZone
    cellSet         actuationDisk1;//cellSet name when selectionMode = cellSet
    cellZone        actuationDisk1;//cellZone name when selectionMode = cellZone

    actuationDiskSourceCoeffs
    {
        diskDir     (-1 0 0); // orientation of the disk
        Cp          0.53;     // Cp
        Ct          0.58;     // Ct
        diskArea    40;       // disk area
    }
}

disk2
{
    typeModel       actuationDiskSource;
    active          on;
    timeStart       0.0;
    duration        1000.0;
    selectionMode   cellSet;
    cellSet         actuationDisk2;
    cellZone        actuationDisk2;

    actuationDiskSourceCoeffs
    {
        diskDir     (-1 0 0);
        Cp          0.53;
        Ct          0.58;
        diskArea    40;
    }
}
// ************************************************************************* //
